# 01 - Create SQLite Database from CSVs

This notebook creates a local SQLite database (`ecommerce.db`) using the generated CSV datasets in data folder: users, products, orders, and payments. 

1. Load each file using pandas
2. Save them as SQL tables

In [1]:
#Import libraries
import sqlite3
import pandas as pd

In [7]:
#Read in csv files
users = pd.read_csv('../data/users.csv')
products = pd.read_csv('../data/products.csv')
orders = pd.read_csv('../data/orders.csv')
payments = pd.read_csv('../data/payments.csv')

In [8]:
#Check the head of data
users.head()

   user_id signup_date country
0        1  2025-02-25      US
1        2  2025-03-26      US
2        3  2024-05-25      CA
3        4  2025-03-15      UK
4        5  2024-04-20      UK

In [9]:
products.head()

   product_id product_name category   price
0           1         Unit    Books  115.49
1           2      Exactly    Books  285.46
2           3        Ready     Home  220.94
3           4         Most     Home  181.60
4           5         Turn   Beauty   51.03

In [10]:
orders.head()

   order_id  user_id  product_id  quantity  order_date
0         1      923          46         3  2025-04-27
1         2      295           7         3  2024-07-27
2         3      694          38         1  2025-01-03
3         4      560          38         1  2024-08-03
4         5      162          68         2  2025-06-16

In [11]:
payments.head()

   payment_id  order_id payment_type  amount
0           1         1       Paypal  601.32
1           2         2  Credit Card   66.39
2           3         3  Credit Card   33.81
3           4         4    Gift Card   33.81
4           5         5       Paypal  483.30

In [12]:
#Create SQLite database file
conn = sqlite3.connect('../data/ecommerce.db')

#Write the dataframes to SQL tables
users.to_sql('users', conn, index = False, if_exists = 'replace')
products.to_sql('products', conn, index = False, if_exists = 'replace')
orders.to_sql('orders', conn, index = False, if_exists = 'replace')
payments.to_sql('payments', conn, index = False, if_exists = 'replace')

10000

In [19]:
#Check the tables created
pd.read_sql("SELECT name FROM sqlite_master WHERE type='table';", conn)

       name
0     users
1  products
2    orders
3  payments

The SQLite database has been successfully created and contains the following tables:

- users
- products
- orders
- payments

Next, I will write and execute SQL queries in '02_sql_queries.ipynb' to analyze purchasing behavior and user trends

In [20]:
conn.close()